nxp-mcuxpresso/mcux-sdk-examples/mimxrt685audevk/driver_examples/dmic/dmic_multi_channel/dmic_multi_channel.c
/*
 * Copyright 2018 - 2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include <stdlib.h>
#include <string.h>
#include "pin_mux.h"
#include "board.h"
#include "fsl_codec_common.h"
#include "fsl_debug_console.h"
#include "fsl_device_registers.h"
#include "fsl_dmic.h"
#include "fsl_dmic_dma.h"
#include "fsl_i2c.h"
#include "fsl_i2s.h"
#include "fsl_i2s_dma.h"
#include "fsl_inputmux.h"
#include <stdbool.h>
#include "fsl_gpio.h"
#include "fsl_codec_adapter.h"
#include "fsl_cs42448.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define DEMO_ENABLE_DMIC_0 1 /* 1: dmic 0 enabled, 0: dmic 0 disabled */
#define DEMO_ENABLE_DMIC_1 1
#define DEMO_ENABLE_DMIC_2 1
#define DEMO_ENABLE_DMIC_3 1

#define DEMO_ENABLE_DMIC_4 1
#define DEMO_ENABLE_DMIC_5 1
#define DEMO_ENABLE_DMIC_6 1
#define DEMO_ENABLE_DMIC_7 1

#define DEMO_I2S_MASTER_CLOCK_FREQUENCY CLOCK_GetMclkClkFreq()
#define DEMO_I2S_TX                     (I2S3)
#define DEMO_I2S_SAMPLE_RATE            48000
#define I2S_CLOCK_DIVIDER               (24576000 / DEMO_I2S_SAMPLE_RATE / 32 / 8)
#define DEMO_DMA_MEMCPY_LEFT_CHANNEL    0U
#define DEMO_DMA_MEMCPY_RIGHT_CHANNEL   1U

#define DEMO_DMA_CHANNEL_TRIGGER_INPUT_A   kINPUTMUX_Dma0TrigOutAToDma0
#define DEMO_DMA_CHANNEL_TRIGGER_OUTPUT_A  kINPUTMUX_Dma0OtrigChannel16ToTriginChannels
#define DEMO_DMA_CHANNEL_OUT_TRIGGER_INDEX 0

#define DEMO_DMA            (DMA0)
#define DEMO_I2S_TX_CHANNEL (7)

#define DEMO_DMIC_DMA_RX_CHANNEL_0 16U
#define DEMO_DMIC_DMA_RX_CHANNEL_1 17U
#define DEMO_DMIC_DMA_RX_CHANNEL_2 18U
#define DEMO_DMIC_DMA_RX_CHANNEL_3 19U
#define DEMO_DMIC_DMA_RX_CHANNEL_4 20U
#define DEMO_DMIC_DMA_RX_CHANNEL_5 21U
#define DEMO_DMIC_DMA_RX_CHANNEL_6 22U
#define DEMO_DMIC_DMA_RX_CHANNEL_7 23U
#define DEMO_DMIC_NUMS             (8U)

#define DEMO_DMA_MEMCPY_CHANNEL_0 0
#define DEMO_DMA_MEMCPY_CHANNEL_1 1

#define DEMO_DMIC_CHANNEL_0       kDMIC_Channel0
#define DEMO_DMIC_CHANNEL_1       kDMIC_Channel1
#define DEMO_DMIC_CHANNEL_2       kDMIC_Channel2
#define DEMO_DMIC_CHANNEL_3       kDMIC_Channel3
#define DEMO_DMIC_CHANNEL_4       kDMIC_Channel4
#define DEMO_DMIC_CHANNEL_5       kDMIC_Channel5
#define DEMO_DMIC_CHANNEL_6       kDMIC_Channel6
#define DEMO_DMIC_CHANNEL_7       kDMIC_Channel7
#define DEMO_CODEC_I2C_BASEADDR   I2C2
#define DEMO_CODEC_I2C_INSTANCE   2U
#define DEMO_CODEC_I2C_CLOCK_FREQ CLOCK_GetFlexCommClkFreq(2U)

#define DEMO_TDM_DATA_START_POSITION 1U
#define FIFO_DEPTH           (15U)
#define PLAYBACK_BUFFER_SIZE (1024)
#define PLAYBACK_BUFFER_NUM  (2U)
#define RECORD_BUFFER_SIZE   (64)
#define RECORD_BUFFER_NUM    (DEMO_DMIC_NUMS * PLAYBACK_BUFFER_NUM)
#if DEMO_ENABLE_DMIC_0
#define DEMO_DMIC_MAX_ID 0
#endif
#if DEMO_ENABLE_DMIC_1
#undef DEMO_DMIC_MAX_ID
#define DEMO_DMIC_MAX_ID 1
#endif
#if DEMO_ENABLE_DMIC_2
#undef DEMO_DMIC_MAX_ID
#define DEMO_DMIC_MAX_ID 2
#endif
#if DEMO_ENABLE_DMIC_3
#undef DEMO_DMIC_MAX_ID
#define DEMO_DMIC_MAX_ID 3
#endif
#if DEMO_ENABLE_DMIC_4
#undef DEMO_DMIC_MAX_ID
#define DEMO_DMIC_MAX_ID 4
#endif
#if DEMO_ENABLE_DMIC_5
#undef DEMO_DMIC_MAX_ID
#define DEMO_DMIC_MAX_ID 5
#endif
#if DEMO_ENABLE_DMIC_6
#undef DEMO_DMIC_MAX_ID
#define DEMO_DMIC_MAX_ID 6
#endif
#if DEMO_ENABLE_DMIC_7
#undef DEMO_DMIC_MAX_ID
#define DEMO_DMIC_MAX_ID 7
#endif
#ifndef DEMO_DMIC_MAX_ID
#error "Please enable at least one DMIC"
#endif
/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static void i2s_Callback(I2S_Type *base, i2s_dma_handle_t *handle, status_t completionStatus, void *userData);
static void memcpy_channel_callback(struct _dma_handle *handle, void *userData, bool transferDone, uint32_t intmode);
static void DEMO_DMAChannelConfigurations(void);
static void DEMO_RecordDMIC(void);
static void DEMO_DMICChannelConfigurations(void);
#ifdef DMIC_FLASH_TARGET
static void ReceiverTransferConfig(dmic_transfer_t *startAddress,
                                   void *dataAddr,
                                   uint32_t xferNum,
                                   uint32_t dataWidth,
                                   uint32_t dataSizePerTransfer,
                                   uint32_t interleaveSize,
                                   uint32_t startChannel);
#else
static void ReceiverTransferConfig(dmic_transfer_t *startAddress,
                                   void *dataAddr,
                                   uint32_t xferNum,
                                   uint32_t dataWidth,
                                   uint32_t dataSizePerTransfer,
                                   uint32_t interleaveSize);
#endif
static void DEMO_InitCodec(void);
extern void BORAD_CodecReset(bool state);
static void DEMO_DMAMemcpyChannelConfigurations(void);
#ifdef DMIC_FLASH_TARGET
static void dmic_Callback(struct _dma_handle *handle, void *userData, bool transferDone, uint32_t intmode);
#else
static void dmic_Callback(DMIC_Type *base, dmic_dma_handle_t *handle, status_t status, void *userData);
#endif
/*******************************************************************************
 * Variables
 ******************************************************************************/
cs42448_config_t cs42448Config = {
    .DACMode      = kCS42448_ModeSlave,
    .ADCMode      = kCS42448_ModeSlave,
    .reset        = NULL,
    .master       = false,
    .i2cConfig    = {.codecI2CInstance = DEMO_CODEC_I2C_INSTANCE},
    .format       = {.sampleRate = 48000U, .bitWidth = 24U},
    .bus          = kCS42448_BusTDM,
    .slaveAddress = CS42448_I2C_ADDR,
};

codec_config_t boardCodecConfig = {.codecDevType = kCODEC_CS42448, .codecDevConfig = &cs42448Config};
static i2s_config_t tx_config;
static uint32_t volatile s_RecordEmptyBlock = PLAYBACK_BUFFER_NUM;
/* DMIC dma handle for 8 channel */
#ifndef DMIC_FLASH_TARGET
static dmic_dma_handle_t s_dmicDmaHandle[DEMO_DMIC_NUMS];
#endif
/* dma handle for 8 channel */
static dma_handle_t s_dmaHandle[DEMO_DMIC_NUMS];
/* i2s dma handle */
static dma_handle_t s_i2sTxDmaHandle;
static dma_handle_t s_memcpyDmaHandle0;
static dma_handle_t s_memcpyDmaHandle1;
static i2s_dma_handle_t s_i2sTxHandle;
/* ping pong descriptor */
SDK_ALIGN(dma_descriptor_t s_dmaDescriptorPingpong[RECORD_BUFFER_NUM], 16);
SDK_ALIGN(dma_descriptor_t s_memcpyDescriptor[PLAYBACK_BUFFER_NUM * 2U], 16);
/* dmic transfer configurations */
static dmic_transfer_t s_receiveXfer0[RECORD_BUFFER_NUM / 2];
static dmic_transfer_t s_receiveXfer1[RECORD_BUFFER_NUM / 2];
/* dmic channel configurations */
static dmic_channel_config_t s_dmicChannelConfig = {
    .divhfclk            = kDMIC_PdmDiv1,
    .osr                 = 32U,
    .gainshft            = 3U,
    .preac2coef          = kDMIC_CompValueZero,
    .preac4coef          = kDMIC_CompValueZero,
    .dc_cut_level        = kDMIC_DcCut155,
    .post_dc_gain_reduce = 1U,
    .saturate16bit       = 1U,
    .sample_rate         = kDMIC_PhyFullSpeed,
};

/*!@breif data buffer */
SDK_ALIGN(static uint8_t s_processedAudio[RECORD_BUFFER_SIZE * RECORD_BUFFER_NUM * 4U], 4U);
SDK_ALIGN(static uint8_t s_recordBuffer0[RECORD_BUFFER_SIZE * RECORD_BUFFER_NUM / 2], 4U);
SDK_ALIGN(static uint8_t s_recordBuffer1[RECORD_BUFFER_SIZE * RECORD_BUFFER_NUM / 2], 4U);

static volatile bool s_buffer1Ready      = false;
static volatile bool s_i2sTransferFinish = false;
static codec_handle_t s_codecHandle;
extern codec_config_t boardCodecConfig;
static volatile uint8_t s_dmicBufferIndex = 0U;
static volatile uint8_t s_m2mBufferIndex  = 0U;
static volatile uint8_t s_m2mBufferIndex1 = 0U;
static volatile bool s_isDMICTriggerred   = false;
/*******************************************************************************
 * Code
 ******************************************************************************/

/*!
 * @brief Main function
 */

int main(void)
{
    i2s_transfer_t i2sTxTransfer;

    /* Board pin, clock, debug console init */
    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_InitDebugConsole();

    CLOCK_EnableClock(kCLOCK_InputMux);

    /* attach AUDIO PLL clock to FLEXCOMM3 (I2S3) */
    CLOCK_AttachClk(kAUDIO_PLL_to_FLEXCOMM3);
    /* I2C */
    CLOCK_AttachClk(kFFRO_to_FLEXCOMM2);

