nxp-mcuxpresso/mcux-sdk-examples/mimxrt685audevk/driver_examples/dmic/dmic_multi_channel/dmic_multi_channel.c
    /* attach AUDIO PLL clock to MCLK */
    CLOCK_AttachClk(kAUDIO_PLL_to_MCLK_CLK);
    CLOCK_SetClkDiv(kCLOCK_DivMclkClk, 2);
    SYSCTL1->MCLKPINDIR = SYSCTL1_MCLKPINDIR_MCLKPINDIR_MASK;

    CLOCK_AttachClk(kAUDIO_PLL_to_DMIC_CLK);
    CLOCK_SetClkDiv(kCLOCK_DivDmicClk, 8);

    cs42448Config.i2cConfig.codecI2CSourceClock = CLOCK_GetFlexCommClkFreq(2);
    cs42448Config.format.mclk_HZ                = CLOCK_GetMclkClkFreq();

    PRINTF("DMIC multi channel example.\r\n");

    DEMO_DMAChannelConfigurations();
    DEMO_DMICChannelConfigurations();

    /* i2s configurations */
    /*
     * masterSlave = kI2S_MasterSlaveNormalMaster;
     * mode = kI2S_ModeI2sClassic;
     * rightLow = false;
     * leftJust = false;
     * pdmData = false;
     * sckPol = false;
     * wsPol = false;
     * divider = 1;
     * oneChannel = false;
     * dataLength = 16;
     * frameLength = 32;
     * position = 0;
     * fifoLevel = 4;
     */
    I2S_TxGetDefaultConfig(&tx_config);
    tx_config.divider     = I2S_CLOCK_DIVIDER;
    tx_config.mode        = kI2S_ModeDspWsShort;
    tx_config.wsPol       = true;
    tx_config.dataLength  = 32U;
    tx_config.frameLength = 32 * 8U;
    tx_config.position    = DEMO_TDM_DATA_START_POSITION;

    I2S_TxInit(DEMO_I2S_TX, &tx_config);
    I2S_EnableSecondaryChannel(DEMO_I2S_TX, kI2S_SecondaryChannel1, false, 64 + DEMO_TDM_DATA_START_POSITION);
    I2S_EnableSecondaryChannel(DEMO_I2S_TX, kI2S_SecondaryChannel2, false, 128 + DEMO_TDM_DATA_START_POSITION);
    I2S_EnableSecondaryChannel(DEMO_I2S_TX, kI2S_SecondaryChannel3, false, 192 + DEMO_TDM_DATA_START_POSITION);

    I2S_TxTransferCreateHandleDMA(DEMO_I2S_TX, &s_i2sTxHandle, &s_i2sTxDmaHandle, i2s_Callback, NULL);
    DEMO_RecordDMIC();
    DEMO_DMAMemcpyChannelConfigurations();
    /* init CS42888 */
    DEMO_InitCodec();
    PRINTF("\r\nStart play audio data\r\n");
    while (1)
    {
        if (s_RecordEmptyBlock < PLAYBACK_BUFFER_NUM)
        {
            i2sTxTransfer.data     = s_processedAudio + (s_m2mBufferIndex == 0U ? 0U : 1U) * PLAYBACK_BUFFER_SIZE;
            i2sTxTransfer.dataSize = PLAYBACK_BUFFER_SIZE;
            I2S_TxTransferSendDMA(DEMO_I2S_TX, &s_i2sTxHandle, i2sTxTransfer);
        }

        if ((s_isDMICTriggerred))
        {
            s_isDMICTriggerred = false;
            DMA_StartTransfer(&s_memcpyDmaHandle0);
            DMA_StartTransfer(&s_memcpyDmaHandle1);
        }
    }
}

static void DEMO_DMAChannelConfigurations(void)
{
    uint32_t i = 0;

    /* DMA configurations */
    DMA_Init(DEMO_DMA);

    for (i = 0; i < DEMO_DMIC_NUMS; i++)
    {
        /* configurations for DMIC channel */
        DMA_EnableChannel(DEMO_DMA, i + DEMO_DMIC_DMA_RX_CHANNEL_0);
        DMA_SetChannelPriority(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_0 + i, kDMA_ChannelPriority0);
        DMA_CreateHandle(&s_dmaHandle[i], DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_0 + i);
    }
#ifdef DMIC_FLASH_TARGET
    DMA_SetCallback(&s_dmaHandle[DEMO_DMIC_NUMS - 1U], dmic_Callback, NULL);
#endif
    /* configurations for I2S channel */
    DMA_EnableChannel(DEMO_DMA, DEMO_I2S_TX_CHANNEL);
    DMA_SetChannelPriority(DEMO_DMA, DEMO_I2S_TX_CHANNEL, kDMA_ChannelPriority3);
    DMA_CreateHandle(&s_i2sTxDmaHandle, DEMO_DMA, DEMO_I2S_TX_CHANNEL);

    /* configurations for memcpy channel channel */
    DMA_EnableChannel(DEMO_DMA, DEMO_DMA_MEMCPY_CHANNEL_0);
    DMA_SetChannelPriority(DEMO_DMA, DEMO_DMA_MEMCPY_CHANNEL_0, kDMA_ChannelPriority2);
    DMA_CreateHandle(&s_memcpyDmaHandle0, DEMO_DMA, DEMO_DMA_MEMCPY_CHANNEL_0);
    DMA_SetCallback(&s_memcpyDmaHandle0, NULL, NULL);

    DMA_EnableChannel(DEMO_DMA, DEMO_DMA_MEMCPY_CHANNEL_1);
    DMA_SetChannelPriority(DEMO_DMA, DEMO_DMA_MEMCPY_CHANNEL_1, kDMA_ChannelPriority3);
    DMA_CreateHandle(&s_memcpyDmaHandle1, DEMO_DMA, DEMO_DMA_MEMCPY_CHANNEL_1);
    DMA_SetCallback(&s_memcpyDmaHandle1, memcpy_channel_callback, NULL);

    DMA_DisableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_0);
    DMA_DisableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_1);
    DMA_DisableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_2);
    DMA_DisableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_3);
    DMA_DisableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_4);
    DMA_DisableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_5);
    DMA_DisableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_6);
    DMA_DisableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_7);

    /* Only enable the maximum dmic channel's dma interrupt */
#if DEMO_DMIC_MAX_ID == 0
    DMA_EnableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_0);
#endif
#if DEMO_DMIC_MAX_ID == 1
    DMA_EnableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_1);
#endif
#if DEMO_DMIC_MAX_ID == 2
    DMA_EnableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_2);
#endif
#if DEMO_DMIC_MAX_ID == 3
    DMA_EnableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_3);
#endif
#if DEMO_DMIC_MAX_ID == 4
    DMA_EnableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_4);
#endif
#if DEMO_DMIC_MAX_ID == 5
    DMA_EnableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_5);
#endif
#if DEMO_DMIC_MAX_ID == 6
    DMA_EnableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_6);
#endif
#if DEMO_DMIC_MAX_ID == 7
    DMA_EnableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_7);
#endif
}

static void DEMO_DMAMemcpyChannelConfigurations(void)
{
    DMA_SetupDescriptor(&(s_memcpyDescriptor[0]),
                        DMA_CHANNEL_XFER(true, true, false, true, 2U, kDMA_AddressInterleave1xWidth,
                                         kDMA_AddressInterleave4xWidth, RECORD_BUFFER_SIZE * sizeof(uint32_t)),
                        s_recordBuffer0, &s_processedAudio[2], &(s_memcpyDescriptor[1]));

    DMA_SetupDescriptor(&(s_memcpyDescriptor[1]),
                        DMA_CHANNEL_XFER(true, true, false, true, 2U, kDMA_AddressInterleave1xWidth,
                                         kDMA_AddressInterleave4xWidth, RECORD_BUFFER_SIZE * sizeof(uint32_t)),
                        &s_recordBuffer0[RECORD_BUFFER_SIZE * sizeof(uint32_t)],
                        &s_processedAudio[RECORD_BUFFER_SIZE * sizeof(uint32_t) * 4U + 2], &(s_memcpyDescriptor[0]));

    /* must make sure the memcpy buffer index is not confilct with the DMIC filling buffer index */
    DMA_SubmitChannelDescriptor(&s_memcpyDmaHandle0, &(s_memcpyDescriptor[0]));

