nxp-mcuxpresso/mcux-sdk-examples/mimxrt685audevk/driver_examples/dmic/dmic_multi_channel/dmic_multi_channel.c
    DMA_SetupDescriptor(&(s_memcpyDescriptor[2]),
                        DMA_CHANNEL_XFER(true, true, false, true, 2U, kDMA_AddressInterleave1xWidth,
                                         kDMA_AddressInterleave4xWidth, RECORD_BUFFER_SIZE * sizeof(uint32_t)),
                        s_recordBuffer1, &s_processedAudio[6], &(s_memcpyDescriptor[3]));

    DMA_SetupDescriptor(&(s_memcpyDescriptor[3]),
                        DMA_CHANNEL_XFER(true, true, false, true, 2U, kDMA_AddressInterleave1xWidth,
                                         kDMA_AddressInterleave4xWidth, RECORD_BUFFER_SIZE * sizeof(uint32_t)),
                        &s_recordBuffer1[RECORD_BUFFER_SIZE * sizeof(uint32_t)],
                        &s_processedAudio[RECORD_BUFFER_SIZE * sizeof(uint32_t) * 4U + 6], &(s_memcpyDescriptor[2]));

    /* must make sure the memcpy buffer index is not confilct with the DMIC filling buffer index */
    DMA_SubmitChannelDescriptor(&s_memcpyDmaHandle1, &(s_memcpyDescriptor[2]));
}

static void DEMO_DMICChannelConfigurations(void)
{
    uint32_t i = 0;

    /* dmic channel configurations */
    DMIC_Init(DMIC0);
    DMIC_Use2fs(DMIC0, true);
    bool rightChannel = false;

    for (i = 0U; i < DEMO_DMIC_NUMS; i++)
    {
        if (i % 2)
        {
            rightChannel = true;
        }
        else
        {
            rightChannel = false;
        }

        DMIC_ConfigChannel(DMIC0, (dmic_channel_t)i, (stereo_side_t)rightChannel, &s_dmicChannelConfig);
        DMIC_FifoChannel(DMIC0, i, FIFO_DEPTH, true, true);
#ifndef DMIC_FLASH_TARGET
        DMIC_TransferCreateHandleDMA(DMIC0, &s_dmicDmaHandle[i], dmic_Callback, NULL, &s_dmaHandle[i]);
        DMIC_InstallDMADescriptorMemory(&s_dmicDmaHandle[i], &s_dmaDescriptorPingpong[i * PLAYBACK_BUFFER_NUM],
                                        PLAYBACK_BUFFER_NUM);
#endif
    }
#ifdef DMIC_FLASH_TARGET
    DMA_EnableChannelPeriphRq(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_0);
    DMA_EnableChannelPeriphRq(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_1);
    DMA_EnableChannelPeriphRq(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_2);
    DMA_EnableChannelPeriphRq(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_3);
    DMA_EnableChannelPeriphRq(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_4);
    DMA_EnableChannelPeriphRq(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_5);
    DMA_EnableChannelPeriphRq(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_6);
    DMA_EnableChannelPeriphRq(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_7);

    DMIC_EnableChannelDma(DMIC0, DEMO_DMIC_CHANNEL_0, true);
    DMIC_EnableChannelDma(DMIC0, DEMO_DMIC_CHANNEL_1, true);
    DMIC_EnableChannelDma(DMIC0, DEMO_DMIC_CHANNEL_2, true);
    DMIC_EnableChannelDma(DMIC0, DEMO_DMIC_CHANNEL_3, true);
    DMIC_EnableChannelDma(DMIC0, DEMO_DMIC_CHANNEL_4, true);
    DMIC_EnableChannelDma(DMIC0, DEMO_DMIC_CHANNEL_5, true);
    DMIC_EnableChannelDma(DMIC0, DEMO_DMIC_CHANNEL_6, true);
    DMIC_EnableChannelDma(DMIC0, DEMO_DMIC_CHANNEL_7, true);
#else
    DMIC_EnableChannnel(DMIC0, DMIC_CHANEN_EN_CH0(1));
    DMIC_EnableChannnel(DMIC0, DMIC_CHANEN_EN_CH1(1));
    DMIC_EnableChannnel(DMIC0, DMIC_CHANEN_EN_CH2(1));
    DMIC_EnableChannnel(DMIC0, DMIC_CHANEN_EN_CH3(1));

    DMIC_EnableChannnel(DMIC0, DMIC_CHANEN_EN_CH4(1));
    DMIC_EnableChannnel(DMIC0, DMIC_CHANEN_EN_CH5(1));
    DMIC_EnableChannnel(DMIC0, DMIC_CHANEN_EN_CH6(1));
    DMIC_EnableChannnel(DMIC0, DMIC_CHANEN_EN_CH7(1));
#endif
}

static void memcpy_channel_callback(struct _dma_handle *handle, void *userData, bool transferDone, uint32_t intmode)
{
    if (s_RecordEmptyBlock)
    {
        s_RecordEmptyBlock--;
    }
    s_m2mBufferIndex = s_m2mBufferIndex == 0U ? 1U : 0U;
}

#ifdef DMIC_FLASH_TARGET
static void dmic_Callback(struct _dma_handle *handle, void *userData, bool transferDone, uint32_t intmode)
{
    s_dmicBufferIndex  = s_dmicBufferIndex == 0U ? 1U : 0U;
    s_isDMICTriggerred = true;
}
#else
static void dmic_Callback(DMIC_Type *base, dmic_dma_handle_t *handle, status_t status, void *userData)
{
    if (kStatus_DMIC_Idle == status)
    {
        s_dmicBufferIndex  = s_dmicBufferIndex == 0U ? 1U : 0U;
        s_isDMICTriggerred = true;
    }
}
#endif

static void i2s_Callback(I2S_Type *base, i2s_dma_handle_t *handle, status_t completionStatus, void *userData)
{
    if (s_RecordEmptyBlock < PLAYBACK_BUFFER_NUM)
    {
        s_RecordEmptyBlock++;
    }
}

#ifdef DMIC_FLASH_TARGET
static void ReceiverTransferConfig(dmic_transfer_t *startAddress,
                                   void *dataAddr,
                                   uint32_t xferNum,
                                   uint32_t dataWidth,
                                   uint32_t dataSizePerTransfer,
                                   uint32_t interleaveSize,
                                   uint32_t startChannel)
{
    uint32_t i = 0, offset = 0U;

    for (i = 0; i < xferNum; i += 2)
    {
        DMA_SetupDescriptor(&(s_dmaDescriptorPingpong[i + startChannel * 2U]),
                            DMA_CHANNEL_XFER(true, false, false, true, 2U, kDMA_AddressInterleave0xWidth,
                                             interleaveSize, dataSizePerTransfer),
                            (uint32_t *)DMIC_FifoGetAddress(DMIC0, i / 2U + startChannel),
                            (uint8_t *)((uint32_t)dataAddr + offset),
                            &(s_dmaDescriptorPingpong[i + 1 + startChannel * 2U]));

        DMA_SetupDescriptor(&(s_dmaDescriptorPingpong[i + 1 + startChannel * 2U]),
                            DMA_CHANNEL_XFER(true, false, false, true, 2U, kDMA_AddressInterleave0xWidth,
                                             interleaveSize, dataSizePerTransfer),
                            (uint32_t *)DMIC_FifoGetAddress(DMIC0, i / 2U + startChannel),
                            (uint8_t *)((uint32_t)dataAddr + dataSizePerTransfer * interleaveSize + offset),
                            &(s_dmaDescriptorPingpong[i + startChannel * 2U]));

        offset += dataWidth;
        /* must make sure the memcpy buffer index is not confilct with the DMIC filling buffer index */
        DMA_SubmitChannelDescriptor(&s_dmaHandle[i / 2U + startChannel],
                                    &(s_dmaDescriptorPingpong[i + startChannel * 2U]));
        DMA_StartTransfer(&s_dmaHandle[i / 2U + startChannel]);
    }
}
#else
static void ReceiverTransferConfig(dmic_transfer_t *startAddress,
                                   void *dataAddr,
                                   uint32_t xferNum,
                                   uint32_t dataWidth,
                                   uint32_t dataSizePerTransfer,
                                   uint32_t interleaveSize)
{
    uint32_t i = 0, offset = 0U;

    for (i = 0; i < xferNum; i += 2)
    {
        startAddress[i].data                   = (uint8_t *)((uint32_t)dataAddr + offset);
        startAddress[i].dataWidth              = dataWidth;
        startAddress[i].dataSize               = dataSizePerTransfer;
        startAddress[i].dataAddrInterleaveSize = interleaveSize;
        startAddress[i].linkTransfer           = &startAddress[i + 1];

        startAddress[i + 1].data      = (uint8_t *)((uint32_t)dataAddr + dataSizePerTransfer * interleaveSize + offset);
        startAddress[i + 1].dataWidth = dataWidth;
        startAddress[i + 1].dataSize  = dataSizePerTransfer;
        startAddress[i + 1].dataAddrInterleaveSize = interleaveSize;
        startAddress[i + 1].linkTransfer           = &startAddress[i];

        offset += dataWidth;
    }
}
#endif

