nxp-mcuxpresso/mcux-sdk-examples/mimxrt685audevk/driver_examples/dmic/dmic_multi_channel/dmic_multi_channel.c
static void DEMO_InitCodec(void)
{
    PRINTF("\r\nInit codec\r\n");

    if (CODEC_Init(&s_codecHandle, &boardCodecConfig) != kStatus_Success)
    {
        PRINTF("CODEC_Init failed!\r\n");
        assert(false);
    }
}

#ifdef DMIC_FLASH_TARGET
static void DEMO_RecordDMIC(void)
{
    ReceiverTransferConfig(s_receiveXfer0, s_recordBuffer0, RECORD_BUFFER_NUM / 2, sizeof(uint16_t), RECORD_BUFFER_SIZE,
                           kDMA_AddressInterleave4xWidth, 0U);
    ReceiverTransferConfig(s_receiveXfer1, s_recordBuffer1, RECORD_BUFFER_NUM / 2, sizeof(uint16_t), RECORD_BUFFER_SIZE,
                           kDMA_AddressInterleave4xWidth, 4U);

    DMIC_EnableChannnel(DMIC0,
#if DEMO_ENABLE_DMIC_0
                        DMIC_CHANEN_EN_CH0(1) |
#endif
#if DEMO_ENABLE_DMIC_0
                            DMIC_CHANEN_EN_CH1(1) |
#endif
#if DEMO_ENABLE_DMIC_0
                            DMIC_CHANEN_EN_CH2(1) |
#endif
#if DEMO_ENABLE_DMIC_0
                            DMIC_CHANEN_EN_CH3(1) |
#endif

#if DEMO_ENABLE_DMIC_0
                            DMIC_CHANEN_EN_CH4(1) |
#endif

#if DEMO_ENABLE_DMIC_0
                            DMIC_CHANEN_EN_CH5(1) |
#endif

#if DEMO_ENABLE_DMIC_0
                            DMIC_CHANEN_EN_CH6(1) |
#endif

#if DEMO_ENABLE_DMIC_0
                            DMIC_CHANEN_EN_CH7(1)
#endif
    );
}
#else
static void DEMO_RecordDMIC(void)
{
    ReceiverTransferConfig(s_receiveXfer0, s_recordBuffer0, RECORD_BUFFER_NUM / 2, sizeof(uint16_t), RECORD_BUFFER_SIZE,
                           kDMA_AddressInterleave4xWidth);
    ReceiverTransferConfig(s_receiveXfer1, s_recordBuffer1, RECORD_BUFFER_NUM / 2, sizeof(uint16_t), RECORD_BUFFER_SIZE,
                           kDMA_AddressInterleave4xWidth);

#if DEMO_ENABLE_DMIC_0
    DMIC_TransferReceiveDMA(DMIC0, &s_dmicDmaHandle[0], &s_receiveXfer0[0], DEMO_DMIC_CHANNEL_0);
#endif

#if DEMO_ENABLE_DMIC_1
    DMIC_TransferReceiveDMA(DMIC0, &s_dmicDmaHandle[1], &s_receiveXfer0[2], DEMO_DMIC_CHANNEL_1);
#endif

#if DEMO_ENABLE_DMIC_2
    DMIC_TransferReceiveDMA(DMIC0, &s_dmicDmaHandle[2], &s_receiveXfer0[4], DEMO_DMIC_CHANNEL_2);
#endif

#if DEMO_ENABLE_DMIC_3
    DMIC_TransferReceiveDMA(DMIC0, &s_dmicDmaHandle[3], &s_receiveXfer0[6], DEMO_DMIC_CHANNEL_3);
#endif

#if DEMO_ENABLE_DMIC_4
    DMIC_TransferReceiveDMA(DMIC0, &s_dmicDmaHandle[4], &s_receiveXfer1[0], DEMO_DMIC_CHANNEL_4);
#endif

#if DEMO_ENABLE_DMIC_5
    DMIC_TransferReceiveDMA(DMIC0, &s_dmicDmaHandle[5], &s_receiveXfer1[2], DEMO_DMIC_CHANNEL_5);
#endif

#if DEMO_ENABLE_DMIC_6
    DMIC_TransferReceiveDMA(DMIC0, &s_dmicDmaHandle[6], &s_receiveXfer1[4], DEMO_DMIC_CHANNEL_6);
#endif

#if DEMO_ENABLE_DMIC_7
    DMIC_TransferReceiveDMA(DMIC0, &s_dmicDmaHandle[7], &s_receiveXfer1[6], DEMO_DMIC_CHANNEL_7);
#endif
}
#endif
